$.extend($.validator.messages, {
    required: "กรุณาป้อนข้อมูล.",
    remote: "กรุณาแก้ไขข้อความ.",
    email: "กรุณาป้อนที่อยู่อีเมลให้ถูกต้อง.",
    url: "กรุณาป้อน URL ให้ถูกต้อง.",
    date: "กรุณาป้อนวันที่ให้ถูกต้อง.",
    dateISO: "กรุณาป้อนวันที่ให้ถูกต้องตามรูปแบบสากล.",
    number: "กรุณาป้อนหมายเลขให้ถูกต้อง",
    digits: "กรุณาป้อนตัวเลข",
    creditcard: "กรุณาป้อนหมายเลขบัตรเครดิตให้ถูกต้อง.",
    equalTo: "กรุณาป้อนข้อมูลให้ตรงกัน.",
    maxlength: $.validator.format("กรุณาป้อนข้อมูลมากกว่า {0} ตัวอักษร."),
    minlength: $.validator.format("กรุณาป้อนข้อมูลอย่างน้อย {0} ตัวอักษร."),
    rangelength: $.validator.format("กรุณาป้อนค่าระหว่างตัวอักษร {0} และต้องยาวกว่า {1} ตัวอักษร."),
    range: $.validator.format("กรุณาป้อนค่าระหว่าง {0} และ {1}."),
    max: $.validator.format("กรุณาป้อนค่าน้อยกว่าหรือเท่ากับ {0}."),
    min: $.validator.format("กรุณาป้อนค่าที่มากกว่าหรือเท่ากับ {0}.")
});